<a href="https://colab.research.google.com/github/luislauriano/data_science/blob/master/Manipulando_Tratando_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Atividades**

1. Leitura de arquivos
2. Tratamento de dados
   
   2.1. Renomear colunas
   
   2.2. Verificar tipos
   
   2.3. Deletar dados
3. Concatenar Tabelas
   
   3.1 Agrupamento de dados
   
4. Correlação de Tabelas
5. Regra de Negócio
6. Exportar Dados

Ojetivo: Através da manipulação dos dados, preparar e tratar os dados dos conjunto de dados de vendas e detalhamento. Para gerar uma unica base de dados, que irá servir como relatório, indicador.

# **Importar biblioteca**

Primeiro precisamos importar a biblioteca que iremos utilizar para manipular os dados, neste caso a biblioteca Pandas

In [0]:
import pandas as pd

# **Leitura de arquivos**

Antes de tudo é preciso abrir o arquivo e visualizá-lo com calma, para obter informações de como os dados estão separados, se foi pulada alguma linha antes de iniciar a tabela e se o arquivo está dividido por abas, se for arquivo xlsx.

# Arquivos CSV

Veja o formato de leitura de um arquivo em CSV:

df = pd.read_csv(‘nome_do_arquivo.csv’, sep = ’caracter que separa os dados’, skiprows = número de linhas a serem puladas)

Agora vamos ler o nosso arquivo **Vendas** que está no formato CSV

In [0]:
df_vendas = pd.read_csv('vendas.csv', sep ='|')

# Arquivos XLSX

Os arquivos no formato XLSX são aqueles arquivos conhecidos como Excel

Veja o formato de leitura de um arquivo em XLSX:

df = pd.read_excel(‘nome_do_arquivo.xlsx’, sheet_name = ‘nome da aba’, skiprows = número de linhas a serem pulada)

Veja que o nosso arquivo XLSX possue mais de uma aba, pois possue uma aba para cada estado que o nosso arquivo detalhamento está localizado e também foi preciso pular 1 linha para iniciar a tabela. Precisamos construir um conjunto de dados para cada aba e depois que os dados forem tratados á juntamos.

In [0]:
df_detalhamentoAM = pd.read_excel('detalhamento.xlsx', sheet_name='AM', skiprows=1 )
df_detalhamentoRR = pd.read_excel('detalhamento.xlsx', sheet_name='RR', skiprows=1 )
df_detalhamentoRO = pd.read_excel('detalhamento.xlsx', sheet_name='RO', skiprows=1 )
df_detalhamentoAC = pd.read_excel('detalhamento.xlsx', sheet_name='AC', skiprows=1 )

# **Tratamento de Dados**

A etapa de tratamento e preparação dos dados é a etapa que mais consome tempo do cientista de dados, devido que essa etapa impacta todo o resto do seu projeto.

## Renomeando colunas

De acordo com as boas práticas de programação todas as colunas devem possuir letras minúsculas, sem caracteres especiais e sem espaços. Para facilitar o trabalho quando for preciso chamar essas colunas.

Para renomear uma ou mais colunas se utiliza o formato como um dicionário em python:

df = df.rename(columns={‘coluna1’:’novo_nome1’, ‘coluna2’:’novo_nome2’})

Para renomear todas as colunas se utiliza o formato como uma lista em python:

df.columns = [‘novo_nome1’, ‘novo_nome2’]

Vamos agora renomear todas as colunas dos conjuntos de dados de vendas e detalhamentos.

In [0]:
df_vendas.columns = ['escritorio', 'operadora', 'material', 'data', 'valor_liquido']
df_vendas.head(3)

   escritorio operadora  ...        data valor_liquido
0         101      Vivo  ...  02.01.2020          20.0
1         101      Vivo  ...  30.12.2019          10.0
2         101      Vivo  ...  04.01.2020          20.0

[3 rows x 5 columns]

In [0]:
df_detalhamentoAM.columns = ['loja', 'escritorio', 'uf', 'operadora', 'valor_bruto']
df_detalhamentoAM.head(3)

            loja  escritorio  uf operadora  valor_bruto
0  BEMOL AVENIDA         103  AM     Claro         2651
1  BEMOL AVENIDA         103  AM        Oi         3309
2  BEMOL AVENIDA         103  AM       Tim         1550

In [0]:
df_detalhamentoRR.columns = ['loja', 'escritorio', 'uf', 'operadora', 'valor_bruto']
df_detalhamentoRR.head(3)

              loja  escritorio  uf operadora  valor_bruto
0  BEMOL BOA VISTA         701  RR     Claro          140
1  BEMOL BOA VISTA         701  RR        Oi           20
2  BEMOL BOA VISTA         701  RR       Tim          135

In [0]:
df_detalhamentoRO.columns = ['loja', 'escritorio', 'uf', 'operadora', 'valor_bruto']
df_detalhamentoRO.head(3)

                      loja  escritorio  uf operadora  valor_bruto
0  BEMOL FARMA PORTO VELHO         609  RO     Claro          486
1  BEMOL FARMA PORTO VELHO         609  RO        Oi           90
2  BEMOL FARMA PORTO VELHO         609  RO       Tim           90

In [0]:
df_detalhamentoAC.columns = ['loja', 'escritorio', 'uf', 'operadora', 'valor_bruto']
df_detalhamentoAC.head(3)

               loja  escritorio  uf operadora  valor_bruto
0  BEMOL RIO BRANCO         401  AC     Claro          500
1  BEMOL RIO BRANCO         401  AC        Oi          375
2  BEMOL RIO BRANCO         401  AC       Tim          125

## Verificar tipos de dados

### Verificar tipos

Para verificar quais são os tipos de dados do nosso conjunto podemos utilizar a função dtype. 
Se queremos verificar os tipos de todas as colunas do conjunto de dados utiliza-se a função dtype no plural, dtypes. Veja o formato:

df.dtypes

Agora se queremos verificar o tipo dos dados de uma coluna específica do conjunto de dados, utiliza-se a função no singular, dtype. Veja o formato:

df[‘coluna’].dtype

Agora vamos verificar os tipos de todas as colunas dos nossos conjuntos de dados vendas e detalhamento.

In [0]:
df_vendas.dtypes

escritorio         int64
operadora         object
material          object
data              object
valor_liquido    float64
dtype: object

In [0]:
df_detalhamentoAM.dtypes

loja           object
escritorio      int64
uf             object
operadora      object
valor_bruto     int64
dtype: object

In [0]:
df_detalhamentoRR.dtypes

loja           object
escritorio      int64
uf             object
operadora      object
valor_bruto     int64
dtype: object

In [0]:
df_detalhamentoRO.dtypes

loja           object
escritorio      int64
uf             object
operadora      object
valor_bruto     int64
dtype: object

In [0]:
df_detalhamentoAC.dtypes

loja           object
escritorio      int64
uf             object
operadora      object
valor_bruto     int64
dtype: object

### Alterando tipo de uma coluna

Pode acontecer de uma coluna ser lida como um objeto em (string) e precisa estar como int ou float. Para alterar o tipo da coluna utilizamos a função astype. Veja o formato:

df[‘coluna’] = df[‘coluna’].astype(float)

Vamos precisar alterar o tipo da coluna **valor_liquido** do conjunto de dados de **vendas** para Int.

In [0]:
df_vendas['valor_liquido'] = df_vendas['valor_liquido'].astype(int)

## Deletar dados

Uma das formas de deletar colunas é utilizando a função drop. Veja:

df = df.drop([‘coluna1’, 'coluna2', 'coluna3'], axis = ‘columns’)

Porém a melhor forma seria escolher as colunas que queremos utilizar e as outras colunas serão omitidas e não deletadas. Passando os nomes das colunas que desejamos utilizar e na ordem desejada. Veja o formato:

df = df[[‘coluna1’, ‘coluna2’]].copy()

A partir desse formato vamos escolher as colunas dos nossos conjuntos de dados que iremos utilizar.

In [0]:
df_vendas = df_vendas[['escritorio', 'operadora', 'valor_liquido']].copy()

In [0]:
df_detalhamentoAM = df_detalhamentoAM[['loja', 'escritorio', 'operadora', 'valor_bruto']].copy()
df_detalhamentoRR = df_detalhamentoRR[['loja', 'escritorio', 'operadora', 'valor_bruto']].copy()
df_detalhamentoRO = df_detalhamentoRO[['loja', 'escritorio', 'operadora', 'valor_bruto']].copy()
df_detalhamentoAC = df_detalhamentoAC[['loja', 'escritorio', 'operadora', 'valor_bruto']].copy()

Também poderíamos deletar linhas utilizando a função drop, veja:

df = df.drop([nome_da_linha], axis = ‘index’)

# Concatenar tabelas (Juntar tabelas)

A concatenação de tabelas é utilizada quando desejamos unir duas ou mais tabelas que possuem os mesmos conjuntos de dados. Como os conjuntos de dados (tabelas) no formato XLSX que estão separados por abas. Veja o formato para concatenar tabelas:

df = pd.concat([df1, df2, df3])

Como temos quatro tabelas (conjunto de dados) que são iguais porém estão separados por abas, vamos juntar em um único conjunto de dados. Sendo eles:

In [0]:
print('Amazonas(AM): ')
print(f'Linhas: {df_detalhamentoAM.shape[0]}')
print(f'Colunas {df_detalhamentoAM.shape[1]}')

Amazonas(AM):
Linhas: 126
Colunas 4

In [0]:
print('Roraima(RR): ')
print(f'Linhas: {df_detalhamentoRR.shape[0]}')
print(f'Colunas {df_detalhamentoRR.shape[1]}')

Roraima(RR):
Linhas: 8
Colunas 4

In [0]:
print('Rondônia(RO): ')
print(f'Linhas: {df_detalhamentoRO.shape[0]}')
print(f'Colunas {df_detalhamentoRO.shape[1]}')

Rondônia(RO):
Linhas: 24
Colunas 4

In [0]:
print('Acre(AC): ')
print(f'Linhas: {df_detalhamentoAC.shape[0]}')
print(f'Colunas {df_detalhamentoAC.shape[1]}')

Acre(AC):
Linhas: 4
Colunas 4

Agora vamos unificar, concatenar todos esses conjuntos de dados em uma unica tabela (dataframe).

In [0]:
df_detalhamento = pd.concat([df_detalhamentoAM,df_detalhamentoRR, df_detalhamentoRO, df_detalhamentoAC])

Após juntarmos as tabelas o index do pandas ficará fora de ordem, para ordenar o index novamente precisamos resetá-lo.

In [0]:
df_detalhamento = df_detalhamento.reset_index(drop=True)
df_detalhamento

                     loja  escritorio operadora  valor_bruto
0           BEMOL AVENIDA         103     Claro         2651
1           BEMOL AVENIDA         103        Oi         3309
2           BEMOL AVENIDA         103       Tim         1550
3           BEMOL AVENIDA         103      Vivo         4739
4           BEMOL BARROSO         107     Claro         1495
..                    ...         ...       ...          ...
157  LOJA BEMOL JI-PARANA         205     Claro          123
158      BEMOL RIO BRANCO         401     Claro          500
159      BEMOL RIO BRANCO         401        Oi          375
160      BEMOL RIO BRANCO         401       Tim          125
161      BEMOL RIO BRANCO         401      Vivo          343

[162 rows x 4 columns]

## Agrupamento de dados

O agrupamento consiste em juntar itens iguais do conjunto de dados e sempre vem acompanhado de uma função para agrupar uma coluna e outra função aggregate que vai ditar o que acontecerá com as linhas das outras colunas. Veja o formato:

df =df.groupby( [ ‘coluna1’, ’coluna2’ ].agg({‘coluna3’ : ‘metodo’, ‘coluna4’
,‘metodo’ } ).reset_index()

Existem diversos métodos que podem ser usados para as linhas que estão se repetindo das outras colunas que não forão agrupadas. Os mais utilizados são mean (média), sum (soma), max (maior valor), min (menor valor), first (primeiro valor), last (último valor)

Vamos agora **agrupar** o nosso conjunto de dados de vendas por as colunas **operadora** e **escritorio**, para as outras colunas, utilizaremos o método **sum** para as linhas que estão se repetindo, assim o método irá somar as linhas que se repetem na coluna e transformar em um único registro (linha).

In [0]:
df_vendas = df_vendas.groupby(['operadora', 'escritorio']).agg({'valor_liquido':'sum'})
df_vendas.sort_values(ascending=False, by='valor_liquido').reset_index()

    operadora  escritorio  valor_liquido
0        Vivo         103           4739
1        Vivo         115           4616
2        Vivo         604           4474
3        Vivo         500           3751
4        Vivo         106           3717
..        ...         ...            ...
158        Oi         701             20
159       Tim         530             20
160      Vivo         206             15
161       Tim         614             10
162       Tim         611             10

[163 rows x 3 columns]

Para o nosso conjunto de dados detalhamento, vamos **agrupar** por as colunas **loja**, **operadora** e **escritorio**, repetindo o método usado anteriormente **sum** para as outras colunas.

In [0]:
df_detalhamento = df_detalhamento.groupby(['loja', 'operadora', 'escritorio']).agg({'valor_bruto':'sum'}).reset_index()
df_detalhamento.sort_values(ascending=False, by='valor_bruto').reset_index()

     index                         loja operadora  escritorio  valor_bruto
0        3                BEMOL AVENIDA      Vivo         103         4739
1       19            BEMOL CIDADE NOVA      Vivo         115         4616
2       43  BEMOL FARMA GRANDE CIRCULAR      Vivo         604         4474
3      149               BEMOL TORQUATO      Vivo         500         3751
4      137               BEMOL SHOPPING      Vivo         106         3704
..     ...                          ...       ...         ...          ...
157    156   LOJA BEMOL FARMA ARIQUEMES      Vivo         613           35
158    128  BEMOL PRESIDENTE FIGUEIREDO       Tim         530           20
159      9              BEMOL BOA VISTA        Oi         701           20
160    152         LOJA BEMOL ARIQUEMES      Vivo         206           15
161     46      BEMOL FARMA ITACOATIARA       Tim         611           10

[162 rows x 5 columns]

# **Correlação de Tabelas**

## Merge de tabelas

O método **merge** é utilizado para unir duas tabelas (conjunto de dados) que possuem uma ou mais colunas em comum. Veja o formato:

df = pd.merge( df1, df2, on = [‘colunas em comum’], how = ‘método de priorização’ )

O método de priorização é usado para escolher qual das tabelas passadas será escolhida como preferência. Os método de priorização pode ser left, right, inner ou outer.

Vamos agora juntar os nossos dois conjuntos de dados **df_detalhamento** e **df_vendas** que possuem duas colunas em comum e criar um **novo df**.

In [0]:
df_relatorio = pd.merge(df_detalhamento, df_vendas, on=['operadora', 'escritorio'], how='right')

In [0]:
df_relatorio.head(5)

            loja operadora  escritorio  valor_bruto  valor_liquido
0  BEMOL AVENIDA     Claro         103       2651.0           2652
1  BEMOL AVENIDA        Oi         103       3309.0           3309
2  BEMOL AVENIDA       Tim         103       1550.0           1550
3  BEMOL AVENIDA      Vivo         103       4739.0           4739
4  BEMOL BARROSO     Claro         107       1495.0           1495

Como vocês podem observar, no método **how** a tabela (conjunto de dados) que foi escolhida como preferência foi o **df_vendas**, utilizando o método de priorização right. 
Neste caso a tabela **df_vendas** é mantida e então realizada a correlação com os dados da primeira tabela de acordo com as colunas em comum **operadora** e **escritorio**.

Caso o valor da coluna em comum só exista na tabela (conjunto de dados) **df_vendas**, o valor é preenchido por NaN na coluna da tabela **df_detalhamento**.

### Tratando o pós merge

Quando surgem valores NaN (nulos ou vazios) nas tabelas, as vezes torna-se necessário substituir por algum outro valor. Uma maneira de realizar essa substituição é utilizando a função **fillna**.  Veja o formato:

Para subistituir os NaN de uma coluna específica:

df[‘coluna’] = df[‘coluna’].fillna(novo_valor)

Para subistituir os NaN da tabela (conjunto de dados) inteira:

df = df.fillna(novo_valor)

Na minha análise não encontrei valores faltantes. Mas mesmo assim vou utilizar o fillna para substituir os mesmos por 0 se houver.

In [0]:
df_relatorio = df_relatorio.fillna(0)

# **Regra de Negócio**

##Operações entre colunas (com condicional):

Caso exista alguma condição para determinado calculo na tabela torna-se necessário criar uma função para poder ser aplicado de forma mais rápida a condição em cada linha da tabela.

In [0]:
def status(valor_liquido, valor_bruto):
  if (valor_liquido != valor_bruto):
    return 'alerta'
  else:
    return ''

A partir dessa função vamos criar uma nova coluna, a coluna status. 
Para aplicar a função em todas as linhas da tabela (conjunto de dados) é necessário usar a função applly e a função lambda. Veja o formato:

df[ ‘nova_coluna’ ] = df.apply( lambda row: funcao( row [‘coluna1’] ), axis = 'columns' )

Vamos agora aplicar a função em todas as linhas da nossa tabela (conjunto de dados) **df_relatorio** e criar uma nova coluna.

In [0]:
df_relatorio['status'] = df_relatorio.apply(lambda row: status(row['valor_liquido'], row['valor_bruto']), axis='columns')

O **row** serve para aplicar a função e as colunas que devem ser passadas como paramêtros para a função.

In [0]:
df_relatorio

                           loja operadora  ...  valor_liquido  status
0                 BEMOL AVENIDA     Claro  ...           2652  alerta
1                 BEMOL AVENIDA        Oi  ...           3309
2                 BEMOL AVENIDA       Tim  ...           1550
3                 BEMOL AVENIDA      Vivo  ...           4739
4                 BEMOL BARROSO     Claro  ...           1495
..                          ...       ...  ...            ...     ...
158  LOJA BEMOL FARMA JI PARANA        Oi  ...             95
159  LOJA BEMOL FARMA JI PARANA       Tim  ...             50
160  LOJA BEMOL FARMA JI PARANA      Vivo  ...             70
161        LOJA BEMOL JI-PARANA     Claro  ...            123
162                           0       Tim  ...             10  alerta

[163 rows x 6 columns]

# **Exportanto Dados**

##Exportando para o excel (XLSX)

Primeiro deve-se criar um arquivo em excel em branco, veja o formato:

arquivo = pd.ExcelWriter('nome_do_arquivo.xlsx', engine='xlsxwriter')

Após o arquivo ser criado podemos preencher com a tabela (conjunto de dados) que criamos.

df.to_excel( arquivo, sheet_name = ‘nome da aba onde o arquivo será inserido’, index = False )

O index = False é utilizado para quando o arquivo for salvo não ficar com o index do pandas. Agora é preciso gerar o arquivo.

arquivo.save()

Vamos agora salvar a nossa tabela (conjunto de dados) que criamos no formato xlsx(excel)

In [0]:
writer = pd.ExcelWriter('Relatório final.xlsx')

df_relatorio.to_excel(writer, sheet_name='relatorio', index=False)

writer.save()

##Exportando para CSV

Também poderíamos exportar para um arquivo com extensão .csv apenas seguindo o formato:

In [0]:
df_relatorio.to_csv(‘relatorio_final.csv’, sep = ‘;’, index=False)

Normalmente para separar os dados se utiliza o ponto e vírgula.

#**Conclusão**

Podemos baixar um executavel do python a partir desse notebook e colocar em uma mesma pasta com os arquivos que foram utilizados para criar nossa tabela (conjunto de dados) final. Assim, poderiamos alterar os arquivos e ao dar dois cliques no executavel ele já atualiza e gera uma nova tabela (conjunto de dados) que irá servir como relatório á empresa.